In [1]:
import pandas as pd
from pathlib import Path
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

In [2]:
df = pd.read_csv(Path('SJ_County_2.csv'))
df.head()

      Month  San_Joaquin_Pop  San_Joaquin_Wages  San_Joaquin_Avg_HV
0  1/1/2000           567885               2260              166188
1  2/1/2000           569829               2269              165106
2  3/1/2000           571772               2279              165181
3  4/1/2000           573716               2288              165407
4  5/1/2000           575659               2297              166873

In [3]:
df['Outcome'] = ""

In [4]:
df

         Month  San_Joaquin_Pop  San_Joaquin_Wages  San_Joaquin_Avg_HV Outcome
0     1/1/2000           567885               2260              166188
1     2/1/2000           569829               2269              165106
2     3/1/2000           571772               2279              165181
3     4/1/2000           573716               2288              165407
4     5/1/2000           575659               2297              166873
..         ...              ...                ...                 ...     ...
236   9/1/2019           774394               3996              375185
237  10/1/2019           775925               4024              375178
238  11/1/2019           777456               4052              375510
239  12/1/2019           778986               4080              377430
240   1/1/2020           780517               4108              378080

[241 rows x 5 columns]

In [5]:
df['San_Joaquin_Avg_HV'].mean()

277122.9875518672

In [6]:
df['San_Joaquin_Avg_HV'].median()

265176.0

In [7]:
df['Outcome'] = df['San_Joaquin_Avg_HV'].apply(lambda x: 0 if x <= 280000 else 1)

In [8]:
df

,Month,San_Joaquin_Pop,San_Joaquin_Wages,San_Joaquin_Avg_HV,Outcome
0,1/1/2000,567885,2260,166188,0
1,2/1/2000,569829,2269,165106,0
2,3/1/2000,571772,2279,165181,0
3,4/1/2000,573716,2288,165407,0
4,5/1/2000,575659,2297,166873,0
...,...,...,...,...,...
236,9/1/2019,774394,3996,375185,1
237,10/1/2019,775925,4024,375178,1
238,11/1/2019,777456,4052,375510,1
239,12/1/2019,778986,4080,377430,1
240,1/1/2020,780517,4108,378080,1

In [9]:
y = df["Outcome"]
X = df.drop(columns=["Month","San_Joaquin_Avg_HV","Outcome"])

In [10]:
y

0      0
1      0
2      0
3      0
4      0
      ..
236    1
237    1
238    1
239    1
240    1
Name: Outcome, Length: 241, dtype: int64

In [11]:
X

     San_Joaquin_Pop  San_Joaquin_Wages
0             567885               2260
1             569829               2269
2             571772               2279
3             573716               2288
4             575659               2297
..               ...                ...
236           774394               3996
237           775925               4024
238           777456               4052
239           778986               4080
240           780517               4108

[241 rows x 2 columns]

In [12]:
y.shape

(241,)

In [13]:
X.shape

(241, 2)

In [14]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, 
                                                    y, 
                                                    random_state=1, 
                                                    stratify=y)
X_train.shape

(180, 2)

In [15]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression(solver='lbfgs',
                                max_iter=200,
                                random_state=1)

In [16]:
classifier.fit(X_train, y_train)

LogisticRegression(max_iter=200, random_state=1)

In [17]:
y_pred = classifier.predict(X_test)
results = pd.DataFrame({"Prediction": y_pred, "Actual": y_test}).reset_index(drop=True)
results.head(20)

    Prediction  Actual
0            1       1
1            1       1
2            0       0
3            0       1
4            0       0
5            1       0
6            0       0
7            0       0
8            1       1
9            0       1
10           1       0
11           1       1
12           0       1
13           0       1
14           0       0
15           0       0
16           1       1
17           0       0
18           0       0
19           0       0

In [18]:
from sklearn.metrics import accuracy_score
print(accuracy_score(y_test, y_pred))

0.7704918032786885

In [19]:
from sklearn.metrics import confusion_matrix, classification_report
matrix = confusion_matrix(y_test, y_pred)
print(matrix)

[[30  4]
 [10 17]]

In [20]:
report = classification_report(y_test, y_pred)
print(report)

              precision    recall  f1-score   support

           0       0.75      0.88      0.81        34
           1       0.81      0.63      0.71        27

    accuracy                           0.77        61
   macro avg       0.78      0.76      0.76        61
weighted avg       0.78      0.77      0.77        61